atomiechen/PressureSense/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ADG725_DFU_IMU/main.c
BLE_LBS_DEF(m_lbs);                                                             /**< LED Button Service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr); 

/**< Context for the Queued Write module.*/
static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(2);

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

//-------------------DFU-----------------------

 static void advertising_start(bool erase_bonds);

 /**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt Peer Manager event.
 */
 static void pm_evt_handler(pm_evt_t const * p_evt)
 {
 ret_code_t err_code;

 switch (p_evt->evt_id)
    {
     case PM_EVT_BONDED_PEER_CONNECTED:
     {
     NRF_LOG_INFO("Connected to a previously bonded device.");
     } break;

     case PM_EVT_CONN_SEC_SUCCEEDED:
     {
     NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x,procedure: %d.",
     ble_conn_state_role(p_evt->conn_handle),
     p_evt->conn_handle,
     p_evt->params.conn_sec_succeeded.procedure);
     } break;

     case PM_EVT_CONN_SEC_FAILED:
     {
     /* Often, when securing fails, it shouldn't be restarted, for security reasons.
     * Other times, it can be restarted directly.
     * Sometimes it can be restarted, but only after changing some Security Parameters.
     * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
     * Sometimes it is impossible, to secure the link, or the peer device does not support it.
     * How to handle this error is highly application dependent. */
     } break;

     case PM_EVT_CONN_SEC_CONFIG_REQ:
     {
     // Reject pairing request from an already bonded peer.
     pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
     pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
     } break;

     case PM_EVT_STORAGE_FULL:
     {
     // Run garbage collection on the flash.
     err_code = fds_gc();
     if (err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
     {
     // Retry.
     }
     else
     {
     APP_ERROR_CHECK(err_code);
     }
     } break;

     case PM_EVT_PEERS_DELETE_SUCCEEDED:
     {
     advertising_start(false);
     } break;

     case PM_EVT_PEER_DATA_UPDATE_FAILED:
     {
     //Assert.
     APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
     } break;

     case PM_EVT_PEER_DELETE_FAILED:
     {
     //Assert.
     APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
     } break;

     case PM_EVT_PEERS_DELETE_FAILED:
     {
     //Assert.
     APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
     } break;

     case PM_EVT_ERROR_UNEXPECTED:
     {
     //Assert.
     APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
     } break;

     case PM_EVT_CONN_SEC_START:
     case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
     case PM_EVT_PEER_DELETE_SUCCEEDED:
     case PM_EVT_LOCAL_DB_CACHE_APPLIED:
     case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
     // This can happen when the local DB has changed.
     case PM_EVT_SERVICE_CHANGED_IND_SENT:
     case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
     default:
     break;
    }
}

static void peer_manager_init()
{
     ble_gap_sec_params_t sec_param;
     ret_code_t err_code;

     err_code = pm_init();
     APP_ERROR_CHECK(err_code);

     memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

     // Security parameters to be used for all security procedures.
     sec_param.bond = SEC_PARAM_BOND;
     sec_param.mitm = SEC_PARAM_MITM;
     sec_param.lesc = SEC_PARAM_LESC;
     sec_param.keypress = SEC_PARAM_KEYPRESS;
     sec_param.io_caps = SEC_PARAM_IO_CAPABILITIES;
     sec_param.oob = SEC_PARAM_OOB;
     sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
     sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
     sec_param.kdist_own.enc = 1;
     sec_param.kdist_own.id = 1;
     sec_param.kdist_peer.enc = 1;
     sec_param.kdist_peer.id = 1;

     err_code = pm_sec_params_set(&sec_param);
     APP_ERROR_CHECK(err_code);

     err_code = pm_register(pm_evt_handler);
     APP_ERROR_CHECK(err_code);
 }

 /** @brief Clear bonding information from persistent storage.
 */
 static void delete_bonds(void)
 {
 ret_code_t err_code;

 NRF_LOG_INFO("Erase bonds!");

 err_code = pm_peers_delete();
 APP_ERROR_CHECK(err_code);
 }
 
 /**@brief Function for starting advertising.
 */
 static void advertising_start(bool erase_bonds)
 {
     if (erase_bonds == true)
     {
     delete_bonds();
     //Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
     }
     else
     {
     //uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
		 uint32_t err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
     APP_ERROR_CHECK(err_code);

     NRF_LOG_DEBUG("advertising is started");
     }

     // uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
     // APP_ERROR_CHECK(err_code);
 }
//-------------------DFU-----------------------

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


