atomiechen/PressureSense/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ADG725_DFU_IMU/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            //err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, button_action);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


// uint8_t  DataRead[256];


#define SAMPLES_IN_BUFFER 1
// volatile uint8_t state = 1;

// static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(0);
static nrf_saadc_value_t     m_buffer_pool[2][SAMPLES_IN_BUFFER];
static nrf_ppi_channel_t     m_ppi_channel;
static uint32_t              m_adc_evt_counter;

void timer_handler(nrf_timer_event_t event_type, void * p_context)
{

}


void saadc_sampling_event_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
    err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, timer_handler);
    APP_ERROR_CHECK(err_code);

    /* setup m_timer for compare event every __ ms/us */
    // 设置定时，捕获/比较通道，比较值，清除比较任务，关闭时钟中断
    uint32_t ticks = nrf_drv_timer_us_to_ticks(&m_timer, 25);
    nrf_drv_timer_extended_compare(&m_timer,
                                   NRF_TIMER_CC_CHANNEL2,
                                   ticks,
                                   NRF_TIMER_SHORT_COMPARE2_CLEAR_MASK,
                                   false);


    // 设置PPI两端的通道，一个是比较事件，一个是adc采集任务
    uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer,
                                                                                NRF_TIMER_CC_CHANNEL2);
    uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();

    /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
                                          timer_compare_event_addr,
                                          saadc_sample_task_addr);
    APP_ERROR_CHECK(err_code);
}


void saadc_sampling_event_enable(void)
{
		// 使能定时器
	   nrf_drv_timer_enable(&m_timer);
	
    // 使能PPI通道
    ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);

     // 配置一个缓冲
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
     // 配置第二个缓冲
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

}


// 选择传感器方案
SCH_16_16_TRAPEZOID(sch);

void saadc_callback2(nrf_drv_saadc_evt_t const * p_event)
{
    // adc采集中断回调函数

    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {

        // 未连接蓝牙，则不向下执行
        if(m_conn_handle == BLE_CONN_HANDLE_INVALID) {
            ADG725_spi_uninit();
            ADG725_spi_clear();
            mpu6050_twi_uninit();
            mpu6050_twi_clear();
            return;
        }
        
        // 为下次采样准备好缓存
        ret_code_t err_code;
        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
        
        // 读取adc采样转换值
        nrf_saadc_value_t saadc_val = p_event->data.done.p_buffer[0];
        uint8_t out_voltage = saadc_val;
        if (saadc_val < 0) {
          out_voltage = 0;
        } else if (saadc_val > 255) {
          out_voltage = 255;
        }
        
        char ret = sch.record_and_move(out_voltage);
        if (ret == 1) {
          // Read IMU sensor values
          int16_t AccValue[3], GyroValue[3];
          
          // 1. accelerometer
          MPU6050_ReadAcc(&AccValue[0], &AccValue[1], &AccValue[2]);
          // 2. gyroscope
          MPU6050_ReadGyro(&GyroValue[0], &GyroValue[1], &GyroValue[2]);
          // attach IMU data to the data array
          int16_t* address = (int16_t*)&sch.data[sch.data_len];
          *(address++) = AccValue[0];
          *(address++) = AccValue[1];
          *(address++) = AccValue[2];
          *(address++) = GyroValue[0];
          *(address++) = GyroValue[1];
          *(address++) = GyroValue[2];
          
          // recalculate data length
          uint16_t data_len = sch.data_len + 6 * sizeof(int16_t);
          
          // send data
          ble_lbs_send_data(m_conn_handle, &m_lbs, sch.data, data_len);
          
          // add by cwh
          static int count = 0;
          count++;
          if (count == 200) {
            NRF_LOG_INFO("send 200 times");
            // NRF_LOG_INFO("accel value: x=%d y=%d z=%d", acc_values.x, acc_values.y, acc_values.z);
            count = 0;
          }
        }

