atomiechen/PressureSense/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ADG725_DFU_IMU/main.c
        if(m_conn_handle == BLE_CONN_HANDLE_INVALID) {
            ADG725_spi_uninit();
            ADG725_spi_clear();
            mpu6050_twi_uninit();
            mpu6050_twi_clear();
            return;
        }
    }
}


void saadc_init_ppi(void)
{
    ret_code_t err_code;
    nrf_saadc_channel_config_t channel_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);

	// add by cwh
		// channel_config.acq_time = NRF_SAADC_ACQTIME_5US;

    err_code = nrf_drv_saadc_init(NULL, saadc_callback2);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

    //loop_init();
}



/**@brief Function for application main entry.
 */
int power_pin=18;
int main(void)
{
    // Initialize.
    log_init();
    leds_init();

    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    peer_manager_init();
    gap_params_init();
    gatt_init();

    nrf_gpio_cfg_output(power_pin);
    nrf_gpio_pin_clear(power_pin);
    nrf_gpio_cfg_output(8);
    nrf_gpio_cfg_output(6);
    nrf_gpio_cfg_output(15);
    ADG725_spi_clear();  
    //ADG725_spi_init();

    mpu6050_twi_clear();

    // saadc_init();
    // // saadc_init_quick_sample();
    // // saadc_init_out();
    // timers_init1();
    // application_timers_start();

    saadc_init_ppi();
    saadc_sampling_event_init();

    services_init();
    advertising_init();
    conn_params_init();
    
    // Start execution.
    NRF_LOG_INFO("ADG725 example started.");
    advertising_start(false);

    //saadc_sampling_event_enable();
    // Enter main loop.
    for (;;)
    {
      if(temp_connect==true)
      {
        if(flag_connect==true){
          
          //初始化spi
          ADG725_spi_init();
          sch.loop_init();
          
          //power_pin拉高，使能负载开关，给ADG725供电
          nrf_gpio_pin_set(power_pin);
          
          // 初始化TWI和MPU6050
          mpu6050_twi_init();
          
          //使能定时器、ppi及设置缓冲
          saadc_sampling_event_enable();
        }
        else{//蓝牙断开时的各个低功耗设置
          
          // 取消TWI和MPU6050初始化，并拉低通信引脚
          mpu6050_twi_uninit();
          mpu6050_twi_clear();
          
          //power_pin拉低，关闭负载开关
          nrf_gpio_pin_clear(power_pin);
          
          //禁用定时器、ppi
          nrf_drv_ppi_channel_disable(m_ppi_channel);
          nrf_drv_timer_disable(&m_timer);
          
          //取消spi初始化并将每个通信管脚拉低，否则MOSI会有时输出高电平
          ADG725_spi_uninit();
          ADG725_spi_clear();
          
        }
        temp_connect=false;
      }

      idle_state_handle();
    }

}


/**
 * @}
 */
